import { Locale } from "react-date-object";

const ja: Locale = {
  name: "ja",
  months: [
    ["1", "1"],
    ["2", "2"],
    ["3", "3"],
    ["4", "4"],
    ["5", "5"],
    ["6", "6"],
    ["7", "7"],
    ["8", "8"],
    ["9", "9"],
    ["10", "10"],
    ["11", "11"],
    ["12", "12"],
  ],
  weekDays: [
    ["日曜日", "日"],
    ["月曜日", "月"],
    ["火曜日", "火"],
    ["水曜日", "水"],
    ["木曜日", "木"],
    ["金曜日", "金"],
    ["土曜日", "土"],
  ],
  digits: ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
  meridiems: [
    ["午前", "AM"],
    ["午後", "PM"],
  ],
};

export default ja;
